Revit 2026 API

# PageOrientationType Enumeration

---

An enumerated type listing all Page Orientation types of Print Setting

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PageOrientationType
```
```vb
Public Enumeration PageOrientationType
```
```cpp
public enum class PageOrientationType
```
```fsharp
type PageOrientationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Auto | 2 | Auto Page Orientation |
| Landscape | 1 | The type of Page Orientation is Landscape |
| Portrait | 0 | The type of Page Orientation is Portrait |

#### Reference

Autodesk.Revit.DB Namespace